'''
Виведіть площу виділеного червоним трикутника.

1) Запросіть два числа a і b - сторони прямокутника.
2) Зверніть увагу: площа червоного трикутника дорівнює половині площі намальованого прямокутника!
Відповідь має відповідати формату виведення, як вказано в прикладі. 
Формула знаходження площі  прямокутника S = a * b.
'''
a = float(input("Введіть довжину прямокутника (a): "))
b = float(input("Введіть ширину прямокутника (b): "))
re_area = a * b
print(re_area)
t_area = re_area / 2
print(f"Площа червоного трикутника S = {t_area}")
